<?php

return [
    'custom' => 'Загрузка файла не удалась.',
    'not-found' => 'Файл :attribute не найден.',
    'extensions' => 'Разрешена загрузка файлов только со следующими расширениями: :extensions.',
    'mime-types' => 'Разрешена загрузка файлов только со следующими MIME-типами: :types.',
    'max-size' => 'Файл ":file" слишком большой. Размер не должен превышать :limit.',
    'min-size' => 'Файл ":file" слишком маленький. Размер должен быть более :limit.',
    'not-image' => 'Файл не является изображением.',
    'min-width' => 'Ширина изображения слишком маленькая: :fileSize (в пискелях). Ширина должна быть более :requiredSize (в пискелях).',
    'max-width' => 'Ширина изображения слишком большая: :fileSize (в пискелях). Ширина не должна превышать :requiredSize (в пискелях).',
    'min-height' => 'Высота изображения слишком маленькая: :fileSize (в пискелях). Высота должна быть более :requiredSize (в пискелях).',
    'max-height' => 'Высота изображения слишком большая: :fileSize (в пискелях). Высота не должна превышать :requiredSize (в пискелях).',
];
